// 비트 이동 연산자 : >>, >>>, <<

package step04;

public class Exam04_4 {
    public static void main(String[] args){
        int i = 0b01101001; // 105

        System.out.println(i >>> 1); // 00110100|1 = 52
        System.out.println(i >>> 2); //   110100|1 -> 00011010|0 = 26
        //  --> 0110100|0 한비트 이동하고 빈자리는 0으로 채우고, 넘어간 비트는 자름 
        System.out.println(i >>> 3); // 00001101|0 = 13
        System.out.println(i >>> 4); // 00000110|1 = 6
        // >>> 연산자를 사용하여 오른쪽으로 이동한다면,
        // 왼쪽 빈자리는 무조건 0으로 채운다.


        // 음수를 이동
        i = 0b11111111_11111111_11111111_10101001; // -87
        System.out.println(i);
        System.out.println(i >>> 1); 
        // 0_11111111_11111111_11111111_1010100|1   => -44
        // => 왼쪽 앞의 빈자리는 0으로 채운다 -> 양수값

        System.out.println(i >>> 2); 
        // 00_11111111_11111111_11111111_101010|01 

        System.out.println(i >>> 3);
        // 000_11111111_11111111_11111111_10101|001

        System.out.println(i >>> 4); 
        // 0000_11111111_11111111_11111111_1010|1001
    }
}
